#### Series Data Structure

In [65]:
import pandas as pd

In [66]:
s = pd.Series([57,99,89,55,36,66])

In [67]:
s                                      # indexing mentioned by default

0    57
1    99
2    89
3    55
4    36
5    66
dtype: int64

In [68]:
s.dtype

dtype('int64')

In [69]:
type(s)

pandas.core.series.Series

In [70]:
s.size

6

In [71]:
s.shape

(6,)

#### DataFrame

In [72]:
r = pd.Series([9,4,7,5,6])
n = pd.Series(['anil','rani','kumar','priya','lily'])
m = pd.Series([67.99,56.87,34.98,45.78,34.22])

In [73]:
df = pd.DataFrame({
    'roll':r,
    'name':n,
    'marks':m
})

In [74]:
df

   roll   name  marks
0     9   anil  67.99
1     4   rani  56.87
2     7  kumar  34.98
3     5  priya  45.78
4     6   lily  34.22

In [75]:
type(df)

pandas.core.frame.DataFrame

In [76]:
df.dtypes

roll       int64
name      object
marks    float64
dtype: object

In [77]:
df.shape

(5, 3)

In [78]:
df.size

15

##### Working with Datasets

In [ ]:
# Location : https://mitu.co.in/dataset
# Download : student.csv 
# Save in your current working directory

In [79]:
# How to find the current working folder
import os
os.getcwd()

'C:\\Users\\spark'

In [ ]:

# https://mitu.co.in/dataset
# https://mitu.co.in/dataset
# https://drive.google.com/drive/u/4/folders/1YujA_GjKigwSJXbRJTkO1l2p1gMmm8ai

In [80]:
import os

In [81]:
 os.getcwd()

'C:\\Users\\spark'

#### Import  the data

In [82]:
import pandas as pd
df = pd.read_csv( "C:\\Users\\spark\\Downloads\\student_marks.csv.csv")
print(df)

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
5     6   ayesha    BE  49.55   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21

In [83]:
df                                            # data frame

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
5     6   ayesha    BE  49.55   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21

In [84]:
type(df)

pandas.core.frame.DataFrame

In [85]:
df.shape                        # attribute

(10, 5)

In [86]:
df.size                           # attribute

50

In [87]:
df.dtypes                          # attribute

roll       int64
name      object
class     object
marks    float64
age        int64
dtype: object

In [88]:
df.columns

Index(['roll', 'name', 'class', 'marks', 'age'], dtype='object')

In [89]:
# methods or functions of that object
df.head()                   # to find first 5 objects of the data frame head is used
                            # default is 5 but can be changed as below

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20

In [90]:
df.head(3)

   roll    name class  marks  age
0     1    anil    TE  56.77   22
1     2    amit    TE  59.77   21
2     3  aniket    BE  76.88   19

In [91]:
df.tail()                              # inverse or to check last 5 data entries

   roll    name class  marks  age
5     6  ayesha    BE  49.55   20
6     7    amar    BE  65.34   19
7     8   amita    BE  68.33   23
8     9    amol    TE  56.75   20
9    10   anmol    BE  78.66   21

In [92]:
df.tail(3)

   roll   name class  marks  age
7     8  amita    BE  68.33   23
8     9   amol    TE  56.75   20
9    10  anmol    BE  78.66   21

##### Slicing- Index Based

In [ ]:
# sometimes we dont have to copy or do not need to have the entries of all 
#the column and rows. 
# two kinds of slicing are there
# Index- based
#

In [93]:
x = df.iloc[3:9, 1:4]              # row and column sequence are mentioned there

In [94]:
x

      name class  marks
3  ajinkya    TE  69.66
4     asha    TE  63.28
5   ayesha    BE  49.55
6     amar    BE  65.34
7    amita    BE  68.33
8     amol    TE  56.75

In [95]:
df.iloc[:5, 1:]

      name class  marks  age
0     anil    TE  56.77   22
1     amit    TE  59.77   21
2   aniket    BE  76.88   19
3  ajinkya    TE  69.66   20
4     asha    TE  63.28   20

In [96]:
df.iloc[4, :]

roll         5
name      asha
class       TE
marks    63.28
age         20
Name: 4, dtype: object

In [97]:
 df.iloc[[5,7,8,3] , :]                       # sequence of rows and collection of random 
                                              # rows can be given too

   roll     name class  marks  age
5     6   ayesha    BE  49.55   20
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20
3     4  ajinkya    TE  69.66   20

In [98]:
 df.iloc[:,[2,1,3]]

  class     name  marks
0    TE     anil  56.77
1    TE     amit  59.77
2    BE   aniket  76.88
3    TE  ajinkya  69.66
4    TE     asha  63.28
5    BE   ayesha  49.55
6    BE     amar  65.34
7    BE    amita  68.33
8    TE     amol  56.75
9    BE    anmol  78.66

In [99]:
df.iloc[:5, 1:]

      name class  marks  age
0     anil    TE  56.77   22
1     amit    TE  59.77   21
2   aniket    BE  76.88   19
3  ajinkya    TE  69.66   20
4     asha    TE  63.28   20

In [100]:
df.iloc[:, 1]               # series (single column)
                            # and when multiple columns are retrrived its a data frame

0       anil
1       amit
2     aniket
3    ajinkya
4       asha
5     ayesha
6       amar
7      amita
8       amol
9      anmol
Name: name, dtype: object

#### Slicing - label based

In [ ]:
# Remembering number will be difficult sometime so we use label-based slicing
# instead of using numbers names will be used
# for that purpose loc is used

In [101]:
df.loc[:,'name']

0       anil
1       amit
2     aniket
3    ajinkya
4       asha
5     ayesha
6       amar
7      amita
8       amol
9      anmol
Name: name, dtype: object

In [102]:
df.loc[:,['name','marks']]

      name  marks
0     anil  56.77
1     amit  59.77
2   aniket  76.88
3  ajinkya  69.66
4     asha  63.28
5   ayesha  49.55
6     amar  65.34
7    amita  68.33
8     amol  56.75
9    anmol  78.66

In [103]:
df[['name','marks']]                         # without using loc also we can retrive

      name  marks
0     anil  56.77
1     amit  59.77
2   aniket  76.88
3  ajinkya  69.66
4     asha  63.28
5   ayesha  49.55
6     amar  65.34
7    amita  68.33
8     amol  56.75
9    anmol  78.66

In [104]:
df.name                             # dot operator dont require square bracket also

0       anil
1       amit
2     aniket
3    ajinkya
4       asha
5     ayesha
6       amar
7      amita
8       amol
9      anmol
Name: name, dtype: object

#### Functions / Methods of dataframe and series

In [105]:
# operations that we perform onto the functions and methods we can use

In [106]:
df['marks'].mean()

64.499

In [107]:
df['marks'].min()

49.55

In [108]:
df['marks'].max()

78.66

In [109]:
df['marks'].sum()

644.9899999999999

In [110]:
df['marks'].median()

64.31

In [111]:
df['marks'].count()

10

In [112]:
df.max()       # functions can also be performed on the entire dataframe not just a series

roll         10
name     ayesha
class        TE
marks     78.66
age          23
dtype: object

In [113]:
df.sum()                # can be applied directly

roll                                                    55
name     anilamitaniketajinkyaashaayeshaamaramitaamolanmol
class                                 TETEBETETEBEBEBETEBE
marks                                               644.99
age                                                    205
dtype: object

In [114]:
df.info()                # functions to describe and understand the data from variou angles

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   roll    10 non-null     int64
 1   name    10 non-null     object
 2   class   10 non-null     object
 3   marks   10 non-null     float64
 4   age     10 non-null     int64
dtypes: float64(1), int64(2), object(2)
memory usage: 532.0+ bytes

In [115]:
df.describe()   # describe method, which we use here to check numerical properties.
                # generally our ai concept whatever we are using or machine learning concept
                # are numerical one, so to check the numerical properties of the data

           roll      marks        age
count  10.00000  10.000000  10.000000
mean    5.50000  64.499000  20.500000
std     3.02765   9.207179   1.269296
min     1.00000  49.550000  19.000000
25%     3.25000  57.520000  20.000000
50%     5.50000  64.310000  20.000000
75%     7.75000  69.327500  21.000000
max    10.00000  78.660000  23.000000

#### Custom Column Operations

In [ ]:
# creating a new column

In [116]:
df

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
5     6   ayesha    BE  49.55   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21

In [120]:
df['marks'] / 10 + 0.47             # in the df if we perform any operation
                                    # for every entry in the said column we perform 
                                    # the same operation on all elements of data array

0    6.147
1    6.447
2    8.158
3    7.436
4    6.798
5    5.425
6    7.004
7    7.303
8    6.145
9    8.336
Name: marks, dtype: float64

In [123]:
df['cgpa'] = df['marks'] / 10 + 0.47 
df
# to add one more column and do some operations on it
# if the column is not there it will add it, if present it will replace it

   roll     name class  marks  age   cgpa
0     1     anil    TE  56.77   22  6.147
1     2     amit    TE  59.77   21  6.447
2     3   aniket    BE  76.88   19  8.158
3     4  ajinkya    TE  69.66   20  7.436
4     5     asha    TE  63.28   20  6.798
5     6   ayesha    BE  49.55   20  5.425
6     7     amar    BE  65.34   19  7.004
7     8    amita    BE  68.33   23  7.303
8     9     amol    TE  56.75   20  6.145
9    10    anmol    BE  78.66   21  8.336

In [133]:
o = ['M','M','M','M','F','F','M','F','M','M']  # manually adding a column 'gender'
                                               # custom column

In [131]:
df['gender'] = o

In [132]:
df

   roll     name class  marks  age   cgpa gender
0     1     anil    TE  56.77   22  6.147      M
1     2     amit    TE  59.77   21  6.447      M
2     3   aniket    BE  76.88   19  8.158      M
3     4  ajinkya    TE  69.66   20  7.436      M
4     5     asha    TE  63.28   20  6.798      F
5     6   ayesha    BE  49.55   20  5.425      F
6     7     amar    BE  65.34   19  7.004      M
7     8    amita    BE  68.33   23  7.303      F
8     9     amol    TE  56.75   20  6.145      M
9    10    anmol    BE  78.66   21  8.336      M

In [ ]:
# combine or Merging of dataframes of equal length

In [138]:

r = pd.Series([1,2,3,4,5])
n=  pd.Series(['ajay', 'rani','priya','kiran','raju'])
m = pd.Series([67.89,53.78,82.45,76.45,61.89])
c = pd.Series(['TE','TE','BE','TE','TE'])
a=  pd.Series([21,22,22,21,20])

In [139]:
newdf = pd.DataFrame({
    'roll':r,
    'name':n,
    'class':c,
    'marks':m,
    'age' :a 
})
newdf

   roll   name class  marks  age
0     1   ajay    TE  67.89   21
1     2   rani    TE  53.78   22
2     3  priya    BE  82.45   22
3     4  kiran    TE  76.45   21
4     5   raju    TE  61.89   20

#### Boolean Filtering

In [ ]:
mask = df['marks'] >60

In [ ]:
 df [mask]

In [ ]:
df[ df['marks'] >60]

In [ ]:
x= df[( df['marks'] >60) & (df['class']== 'BE')]

In [ ]:
x

##### Data Export

In [ ]:
x.to_csv('output.csv',index=False)